app/controllers/pokemons_controller.rb

SELECT "pokemons".* FROM "pokemons"
SELECT "pokemons".* FROM "pokemons" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 10]]
---
    def index
        per_page = params[:per_page] || 10
        page = params[:page] || 1
        all = params[:all]

        if all
            @pokemons = Pokemon.all
        else
            @pokemons = Pokemon.paginate(:page => page, :per_page => per_page)

INSERT INTO "pokemons" ("number", "name", "type1", "type2", "total", "hp", "attack", "defense", "sp_atk", "sp_def", "speed", "generation", "legendary", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @pokemon = Pokemon.new(pokemon_params)
        if @pokemon.save

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 1600], ["LIMIT", 1]]
UPDATE "pokemons" SET "name" = ?, "total" = ?, "hp" = ?, "attack" = ?, "defense" = ?, "sp_atk" = ?, "sp_def" = ?, "speed" = ?, "generation" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?
---
    def update
        @pokemon = Pokemon.find(params[:id])
        if @pokemon.update(pokemon_params)

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 1602], ["LIMIT", 1]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 1601]]
---
    def destroy
        @pokemon = Pokemon.find(params[:id])
        @pokemon.destroy